# GenericZoneDomainData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GenericZoneDomainData Class
Members See Also
---
A base class for specific domain requirements for a generic zone.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public class GenericZoneDomainData : IDisposable
```

Visual Basic
---
```text
Public Class GenericZoneDomainData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class GenericZoneDomainData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..GenericZoneDomainData Autodesk.Revit.DB.Mechanical..::..SystemZoneData
# See Also
GenericZoneDomainData Members
Autodesk.Revit.DB.Analysis Namespace